In [2]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

#### Задание 1. 

Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [151]:
def read_data(group_number, info_dfs, marks_dfs):
    students_info = pd.read_csv(f'Data\Students_info_{group_number}.csv')
    students_marks = pd.read_csv(f'Data\Students_marks_{group_number}.csv')

    info_dfs.append(students_info)
    marks_dfs.append(students_marks)


info_dfs = []
marks_dfs = []

for i in range(10):
    read_data(i, info_dfs, marks_dfs)

students_info_df = pd.concat(info_dfs, ignore_index=True)
students_marks_df = pd.concat(marks_dfs, ignore_index=True)

df = pd.merge(students_info_df, students_marks_df, on='index')
df.head()

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,1,female,group C,some college,standard,completed,group1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,4,male,group C,some college,standard,none,group1,76,78,75

#### Задание 2. 

Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы. Выведите на экран размеры полученной таблицы.

In [152]:
df.drop('index', axis=1, inplace=True)
print(f'Размеры таблицы: {df.shape}')
df.head(10)

Размеры таблицы: (1000, 9)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. 

Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [153]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 4. 

Проверьте, есть ли в таблице пропущенные значения

In [154]:
df.isna().any()

gender                         False
race/ethnicity                 False
parental level of education    False
lunch                          False
test preparation course        False
group                          False
math score                     False
reading score                  False
writing score                  False
dtype: bool

#### Задание 5. 

Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [155]:
df.mean(numeric_only=True)

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

#### Задание 6. 

Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.

In [156]:
df.groupby('test preparation course').mean(numeric_only=True)

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673

#### Задание 7. 

Выведите на экран все различные значения из столбца lunch.

In [157]:
print(df['lunch'].unique())

['standard' 'free/reduced']

#### Задание 8. 

Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [158]:
df.rename(columns={'parental level of education': 'education', 'test preparation course': 'test preparation'}, inplace=True)
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75

**Зафиксируем минимальный балл для сдачи экзамена**

In [159]:
passmark = 50

#### Задание 9. 

Ответьте на вопросы:

    * Какая доля студентов сдала экзамен по математике (passmark > 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [311]:
passed_math_ratio = (df['math score'] >= passmark).sum() / len(df)

prep_course_passed_math = df[df['test preparation'] == 'completed']['math score'] >= passmark
passed_math_prep_course_ratio = prep_course_passed_math.sum() / len(prep_course_passed_math)

female_no_prep_failed_math = df[(df['gender'] == 'female') & (df['test preparation'] == 'none')]['math score'] < passmark
failed_math_no_prep_female_ratio = female_no_prep_failed_math.sum() / len(female_no_prep_failed_math)

print(f'Доля студентов, сдавших экзамен по математике: {passed_math_ratio:.2%}')
print(f'Доля студентов, сдавших экзамен по математике после прохождения курса подготовки: {passed_math_prep_course_ratio:.2%}')
print(f'Доля женщин, не прошедших курс подготовки и не сдавших экзамен по математике: {failed_math_no_prep_female_ratio:.2%}')

Доля студентов, сдавших экзамен по математике: 86.50%
Доля студентов, сдавших экзамен по математике после прохождения курса подготовки: 92.18%
Доля женщин, не прошедших курс подготовки и не сдавших экзамен по математике: 20.96%

#### Задание 10. 

С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.

    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [317]:
import time


start = time.time()
average_reading_score = df.groupby('race/ethnicity')['reading score'].mean()
end = time.time()

print(average_reading_score)
print(f'Время выполнения: {end - start}\n')

start = time.time()
min_writing_score = df.groupby('education')['writing score'].min()
end = time.time()

print(min_writing_score)
print(f'Время выполнения: {end - start}')

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64
Время выполнения: 0.0012078285217285156

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64
Время выполнения: 0.0010652542114257812

#### Задание 11.

Выполните задание 10 с помощью циклов. Сравните время выполнения.

In [318]:
start = time.time()
average_reading_scores = {}
for group in df['race/ethnicity'].unique():
    group_scores = df[df['race/ethnicity'] == group]['reading score']
    average_reading_scores[group] = group_scores.mean()
end = time.time()

print(average_reading_score)
print(f'Время выполнения: {end - start}\n')

start = time.time()
min_writing_scores = {}
for level in df['education'].unique():
    level_scores = df[df['education'] == level]['writing score']
    min_writing_scores[level] = level_scores.min()
end = time.time()

print(min_writing_score)
print(f'Время выполнения: {end - start}')

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64
Время выполнения: 0.004673480987548828

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64
Время выполнения: 0.002187967300415039

In [ ]:
# С помощью groupby задания выполняются быстрее

#### Задание 12. 

Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.

Это можно сделать с помощью сводных таблиц (pivot_table). Дополнительно о них почитать можно тут:

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [225]:
pd.pivot_table(df, index=['gender', 'education'], values=['math score', 'reading score', 'writing score'], aggfunc='mean')

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

#### Задание 13. 

Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [282]:
def count_passed_failed(column):
    passed_count = (df[column] == 'P').sum()
    failed_count = (df[column] == 'F').sum()
    return passed_count, failed_count

df['Math_PassStatus'] = df['math score'].apply(lambda x: 'P' if x >= passmark else 'F')
df['Reading_PassStatus'] = df['reading score'].apply(lambda x: 'P' if x >= passmark else 'F')
df['Writing_PassStatus'] = df['writing score'].apply(lambda x: 'P' if x >= passmark else 'F')

math_passed, math_failed = count_passed_failed('Math_PassStatus')
reading_passed, reading_failed = count_passed_failed('Reading_PassStatus')
writing_passed, writing_failed = count_passed_failed('Writing_PassStatus')

print(f'Math\n  Passed: {math_passed}\n  Failed: {math_failed}')
print(f'Reading\n  Passed: {reading_passed}\n  Failed: {reading_failed}')
print(f'Writing\n  Passed: {writing_passed}\n  Failed: {writing_failed}')

Math
  Passed: 865
  Failed: 135
Reading
  Passed: 910
  Failed: 90
Writing
  Passed: 886
  Failed: 114

In [329]:
# Я узнал о методе value_counts(), когда делал задание 15...

df['Math_PassStatus'] = df['math score'].apply(lambda x: 'P' if x >= passmark else 'F')
df['Reading_PassStatus'] = df['reading score'].apply(lambda x: 'P' if x >= passmark else 'F')
df['Writing_PassStatus'] = df['writing score'].apply(lambda x: 'P' if x >= passmark else 'F')

print(df['Math_PassStatus'].value_counts())
print(df['Reading_PassStatus'].value_counts())
print(df['Writing_PassStatus'].value_counts())

Math_PassStatus
P    865
F    135
Name: count, dtype: int64
Reading_PassStatus
P    910
F     90
Name: count, dtype: int64
Writing_PassStatus
P    886
F    114
Name: count, dtype: int64

#### Задание 14. 

Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [320]:
df['OverAll_PassStatus'] = df.apply(lambda row: 'F' if 'F' in [row['Math_PassStatus'], row['Reading_PassStatus'], row['Writing_PassStatus']] else 'P', axis=1)
(df['OverAll_PassStatus'] == 'P').sum()

812

#### Задание 15. 

Переведем баллы в оценки

*Система перевода баллов в оценки*

        [90;100] = A
        [80;90) = B
        [70;80) = C
        [60;70) = D
        [50;60) = E
        [0;50) = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

In [327]:
def GetGrade(average_mark):
    if 90 <= average_mark <= 100:
        return 'A'
    elif 80 <= average_mark < 90:
        return 'B'
    elif 70 <= average_mark < 80:
        return 'C'
    elif 60 <= average_mark < 70:
        return 'D'
    elif 50 <= average_mark < 60:
        return 'E'
    else:
        return 'F'


df['Grade'] = df[['math score', 'reading score', 'writing score']].mean(axis=1).apply(GetGrade)
df['Grade'].value_counts()

Grade
C    261
D    256
E    182
B    146
F    103
A     52
Name: count, dtype: int64